# Challenge 3

In this challenge we will work on the `Orders.csv` data set in the previous [Subsetting and Descriptive Stats lab](../../lab-subsetting-and-descriptive-stats/your-code/main.ipynb). In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

# Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [1]:
# import required libraries
import numpy as np
import pandas as pd

Next, import `Orders.csv` from the "subsetting" lab folder into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [3]:
# enter your code here
orders = pd.read_csv("Orders.csv")
orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [6]:
orders.columns

Index(['Unnamed: 0', 'InvoiceNo', 'StockCode', 'year', 'month', 'day', 'hour',
       'Description', 'Quantity', 'InvoiceDate', 'UnitPrice', 'CustomerID',
       'Country', 'amount_spent'],
      dtype='object')

In [10]:
# your code here
orders.drop(columns = 'Unnamed: 0', inplace=True)

In [11]:
orders.head()

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

In [47]:
orders.describe()

,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,CustomerID,amount_spent
count,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000
mean,560617.126645,2010.934259,7.612537,3.614555,12.728247,13.021823,3.116174,15294.315171,22.394749
std,13106.167695,0.247829,3.416527,1.928274,2.273535,180.420210,22.096788,1713.169877,309.055588
min,536365.000000,2010.000000,1.000000,1.000000,6.000000,1.000000,0.000000,12346.000000,0.000000
25%,549234.000000,2011.000000,5.000000,2.000000,11.000000,2.000000,1.250000,13969.000000,4.680000
50%,561893.000000,2011.000000,8.000000,3.000000,13.000000,6.000000,1.950000,15159.000000,11.800000
75%,572090.000000,2011.000000,11.000000,5.000000,14.000000,12.000000,3.750000,16795.000000,19.800000
max,581587.000000,2011.000000,12.000000,7.000000,20.000000,80995.000000,8142.750000,18287.000000,168469.600000

In [38]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397924 entries, 0 to 397923
Data columns (total 13 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   InvoiceNo     397924 non-null  int64
 1   StockCode     397924 non-null  object
 2   year          397924 non-null  int64
 3   month         397924 non-null  int64
 4   day           397924 non-null  int64
 5   hour          397924 non-null  int64
 6   Description   397924 non-null  object
 7   Quantity      397924 non-null  int64
 8   InvoiceDate   397924 non-null  object
 9   UnitPrice     397924 non-null  float64
 10  CustomerID    397924 non-null  int64
 11  Country       397924 non-null  object
 12  amount_spent  397924 non-null  float64
dtypes: float64(2), int64(7), object(4)
memory usage: 39.5+ MB

In [17]:
amont_spent = orders.groupby('CustomerID', as_index=False).agg({'amount_spent': np.sum})
amont_spent

      CustomerID  amount_spent
0          12346      77183.60
1          12347       4310.00
2          12348       1797.24
3          12349       1757.55
4          12350        334.40
...          ...           ...
4334       18280        180.60
4335       18281         80.82
4336       18282        178.05
4337       18283       2094.88
4338       18287       1837.28

[4339 rows x 2 columns]

In [48]:
amont_spent.head()

   CustomerID  amount_spent
0       12346      77183.60
1       12347       4310.00
2       12348       1797.24
3       12349       1757.55
4       12350        334.40

In [27]:
rang = amont_spent.describe().transpose()
rang

,count,mean,std,min,25%,50%,75%,max
CustomerID,4339.0,15299.936852,1721.889758,12346.0,13812.500,15299.00,16778.50,18287.00
amount_spent,4339.0,2053.793018,8988.248381,0.0,307.245,674.45,1661.64,280206.02

In [31]:
seventy = rang['75%'][1]
twenty = rang['25%'][1]
twenty

307.24499999999995

In [49]:
quantile_range = amont_spent.loc[(amont_spent['amount_spent'] >= twenty) & (amont_spent['amount_spent'] <= seventy)]
quantile_range

      CustomerID  amount_spent
4          12350        334.40
7          12354       1079.40
8          12355        459.40
11         12358       1168.06
16         12363        552.00
...          ...           ...
4316       18252        526.67
4321       18261        324.24
4323       18263       1213.16
4324       18265        801.51
4331       18276        335.86

[2169 rows x 2 columns]

In [42]:
orders.loc[orders['amount_spent'] >= orders['amount_spent'].max()-100_000]

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
37126,541431,23166,2011,1,2,10,medium ceramic top storage jar,74215,2011-01-18 10:01:00,1.04,12346,United Kingdom,77183.6
397451,581483,23843,2011,12,5,9,"paper craft , little birdie",80995,2011-12-09 09:15:00,2.08,16446,United Kingdom,168469.6

In [54]:
vip_customers = amont_spent.loc[amont_spent['amount_spent'] > np.percentile(amont_spent['amount_spent'], 95)]
vip_customers.head()

    CustomerID  amount_spent
0        12346      77183.60
10       12357       6207.67
12       12359       6372.58
50       12409      11072.67
55       12415     124914.53

In [64]:
vip_customers['amount_spent'].min()

5870.080000000015

In [93]:
Preferred_customers = amont_spent.loc[(amont_spent['amount_spent'] >= amont_spent['amount_spent'].quantile(.75)) & 
                                     (amont_spent['amount_spent'] <= amont_spent['amount_spent'].quantile(.95))]
Preferred_customers.head()

   CustomerID   Country  amount_spent
1       12347   Iceland       4310.00
2       12348   Finland       1797.24
3       12349     Italy       1757.55
5       12352    Norway       2506.04
9       12356  Portugal       2811.43

In [94]:
Preferred_customers['amount_spent'].max()

5756.890000000001

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

# Q2: How to identify which country has the most VIP Customers?

# Q3: How to identify which country has the most VIP+Preferred Customers combined?

Provide your solution for Q2 below:

# Q2: How to identify which country has the most VIP Customers?

In [95]:
customers_c = orders.groupby(['CustomerID', 'Country'], as_index=False).agg({'amount_spent': np.sum})
customers_c

      CustomerID         Country  amount_spent
0          12346  United Kingdom      77183.60
1          12347         Iceland       4310.00
2          12348         Finland       1797.24
3          12349           Italy       1757.55
4          12350          Norway        334.40
...          ...             ...           ...
4342       18280  United Kingdom        180.60
4343       18281  United Kingdom         80.82
4344       18282  United Kingdom        178.05
4345       18283  United Kingdom       2094.88
4346       18287  United Kingdom       1837.28

[4347 rows x 3 columns]

In [96]:
vip_customers = customers_c.loc[customers_c['amount_spent'] > np.percentile(customers_c['amount_spent'], 95)]
vip_customers.head()

    CustomerID         Country  amount_spent
0        12346  United Kingdom      77183.60
10       12357     Switzerland       6207.67
12       12359          Cyprus       6372.58
52       12409     Switzerland      11072.67
57       12415       Australia     124914.53

In [97]:
vip_customers['Country'].value_counts()

United Kingdom     178
Germany             11
France               9
Switzerland          3
Spain                2
Portugal             2
Japan                2
EIRE                 2
Denmark              1
Norway               1
Australia            1
Netherlands          1
Channel Islands      1
Finland              1
Sweden               1
Singapore            1
Cyprus               1
Name: Country, dtype: int64

# Q3: How to identify which country has the most VIP+Preferred Customers combined?

In [98]:
Preferred_customers = customers_c.loc[(customers_c['amount_spent'] >= customers_c['amount_spent'].quantile(.75)) & 
                                     (customers_c['amount_spent'] <= customers_c['amount_spent'].quantile(.95))]

In [99]:
Preferred_customers.head()

   CustomerID   Country  amount_spent
1       12347   Iceland       4310.00
2       12348   Finland       1797.24
3       12349     Italy       1757.55
5       12352    Norway       2506.04
9       12356  Portugal       2811.43

In [100]:
combined = pd.concat([vip_customers, Preferred_customers], axis=0)
combined

      CustomerID         Country  amount_spent
0          12346  United Kingdom      77183.60
10         12357     Switzerland       6207.67
12         12359          Cyprus       6372.58
52         12409     Switzerland      11072.67
57         12415       Australia     124914.53
...          ...             ...           ...
4327       18259  United Kingdom       2338.60
4328       18260  United Kingdom       2643.20
4336       18272  United Kingdom       3078.58
4345       18283  United Kingdom       2094.88
4346       18287  United Kingdom       1837.28

[1087 rows x 3 columns]

In [101]:
combined['Country'].value_counts()

United Kingdom     934
Germany             39
France              29
Belgium             11
Switzerland          9
Norway               7
Portugal             7
Spain                7
Finland              5
Italy                5
Channel Islands      4
Australia            4
Japan                4
Denmark              3
EIRE                 3
Cyprus               3
Sweden               2
Israel               2
Greece               1
Malta                1
Austria              1
Netherlands          1
Singapore            1
Lebanon              1
Canada               1
Poland               1
Iceland              1
Name: Country, dtype: int64